README.md Context update
